app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("artist", "created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["artist", "tset"], ["created_at", Wed, 26 Jun 2013 17:04:13 UTC +00:00], ["title", "test"], ["updated_at", Wed, 26 Jun 2013 17:04:13 UTC +00:00], ["url", "test"]]
---
	def create
	# Make the variable @picture a new picture with the given params
			@picture = Picture.new(params[:picture])
		if @picture.save

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "14"]]
---
	def update
		@picture = Picture.find(params[:id])